FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_ЗапчастиИАксессуары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_ЗапчастиИАксессуары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AdStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowEmail</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AllowEmail</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Availability</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_Availability</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvitoId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Brand</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ПроизводителиЗапчастей</v8:Type>
						<v8:Type>cfg:CatalogRef.ns_ПроизводителиШин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_Category</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Condition</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ConditionЗапчасти</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Homologation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Comment>Уникальный идентификатор объявления в вашей базе данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ListingFee</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ListingFee</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LoadIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Model</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nsDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OEM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Originality</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_Originality</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OriginalOEM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OriginalVendor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResidualTread</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimBolts</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimBolts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimBoltsDiameter</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimBoltsDiameter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimDiameter</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimDiameter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimOffset</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimOffset</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimTypeDisk</v8:Type>
						<v8:Type>cfg:EnumRef.ns_RimTypeWheels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RimWidth</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_RimWidth</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RunFlat</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SpeedIndex</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_SpeedIndex</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TireAspectRatio</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_TireAspectRatio</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TireSectionWidth</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_TireSectionWidthШины</v8:Type>
						<v8:Type>cfg:EnumRef.ns_TireSectionWidthМотошины</v8:Type>
						<v8:Type>cfg:EnumRef.ns_TireSectionWidthКолёса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TireType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_TireType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TypeId</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_TypeIdЗапчасти</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VideoURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WheelAxle</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_WheelAxle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныЗаголовков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаПоказаОбъявления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ЗоныПоказаОбъявления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TiresModels</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_TiresModels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/ns_ОбщегоНазначенияВызовСервера/Ext/Module.bsl
Функция ПолучитьТипСклад() Экспорт
	Возврат ns_Переопределяемый.ПолучитьТипСклад();	
КонецФункции

Процедура УстановитьВыгружатьПоДокументуНаСервере(Документ, ИмяСправочника) Экспорт
	Результат = ns_Переопределяемый.УстановитьВыгружатьПоДокументу(Документ, ИмяСправочника);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого Стр Из Результат Цикл
		УстановитьВыгружатьЭлементу(Стр.Ссылка, Истина);		
	КонецЦикла; 
КонецПроцедуры

Процедура УстановитьВыгружатьНаСервере(ВыделенныеСтроки, Значение = Истина, ИмяСправочника) Экспорт
	Попытка
		НачатьТранзакцию();
		
		Для каждого СтрокаСписка Из ВыделенныеСтроки Цикл
			Если СтрокаСписка.ЭтоГруппа Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ns_ЗапчастиИАксессуары.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ns_ЗапчастиИАксессуары КАК ns_ЗапчастиИАксессуары
				|ГДЕ
				|	ns_ЗапчастиИАксессуары.Родитель В ИЕРАРХИИ(&Родитель)
				|	И ns_ЗапчастиИАксессуары.ЭтоГруппа = ЛОЖЬ";
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ns_ЗапчастиИАксессуары", ИмяСправочника);
				Запрос.УстановитьПараметр("Родитель", СтрокаСписка.Ссылка);

				РезультатЗапроса = Запрос.Выполнить();
				Если РезультатЗапроса.Пустой() Тогда
					Возврат;
				КонецЕсли;  
				
				Выборка = РезультатЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					УстановитьВыгружатьЭлементу(Выборка.Ссылка, Значение);
				КонецЦикла; 
			Иначе	
				УстановитьВыгружатьЭлементу(СтрокаСписка, Значение);
			КонецЕсли;
		КонецЦикла;  
		
		ЗафиксироватьТранзакцию();		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли; 
	    ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
	КонецПопытки; 
КонецПроцедуры

Процедура УстановитьВыгружатьЭлементу(Ссылка, Значение)
	Если НЕ Ссылка.Выгружать = Значение Тогда
		ТекущийОбъект = Ссылка.ПолучитьОбъект();
		ТекущийОбъект.Выгружать = Значение;
		ТекущийОбъект.Записать();
	КонецЕсли; 
КонецПроцедуры

Процедура УстановитьНовоеЗначениеРеквизита(Изменен, ТекущийОбъект, ИмяРеквизита, НовоеЗначение) Экспорт
	Если ЗначениеЗаполнено(НовоеЗначение) И (НЕ ТекущийОбъект[ИмяРеквизита] = НовоеЗначение) Тогда
		ТекущийОбъект[ИмяРеквизита] = НовоеЗначение;
		Изменен = Истина;
	КонецЕсли; 
КонецПроцедуры

Процедура ЗаполнитьСопоставлениеРеквизитов(Изменен, ТекущийОбъект, ЗначенияСопоставленныхРеквизитов, СопоставлениеРеквизитов) Экспорт
	Если НЕ ЗначениеЗаполнено(СопоставлениеРеквизитов) Тогда
		Возврат;	
	КонецЕсли; 
	
	ЗначениеРеквизита = Неопределено;
	
	Для каждого Стр Из СопоставлениеРеквизитов.Сопоставление Цикл
		ТекущееЗначение = ns_ШаблонизаторСервер.ПолучитьЗначениеРеквизита(ТекущийОбъект.Номенклатура, Стр.Реквизит1С, ЗначенияСопоставленныхРеквизитов.ДопРеквизиты);
		Если НЕ ТекущееЗначение = Неопределено Тогда
			Попытка
				ЗначениеРеквизита = Перечисления["ns_" + Стр.РеквизитАвито].ПолучитьЗначениеПеречисления(ТекущееЗначение.Наименование);
				Если НЕ ЗначениеРеквизита = Неопределено Тогда
					ТекущийОбъект[Стр.РеквизитЗапчасти] = ЗначениеРеквизита;
				КонецЕсли;
				Изменен = Истина;
			Исключение
			КонецПопытки;
			
			Если ЗначениеРеквизита = Неопределено И ЗначениеЗаполнено(ТекущееЗначение) Тогда
				Попытка
					ТекущийОбъект[Стр.РеквизитЗапчасти] = ТекущееЗначение;
					Изменен = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 

	Для каждого Стр Из СопоставлениеРеквизитов.СопоставлениеНоменклатуры Цикл
		ТекущееЗначение = ns_ШаблонизаторСервер.ПолучитьЗначениеРеквизита(ТекущийОбъект.Номенклатура, Стр.Реквизит1С, ЗначенияСопоставленныхРеквизитов.Номенклатура);
		Если НЕ ТекущееЗначение = Неопределено Тогда
			Попытка
				Если Стр.РеквизитАвито = "Brand_ПроизводителиЗапчастей" Тогда
					ЗначениеРеквизита = Справочники.ns_ПроизводителиЗапчастей.НайтиЭлементПоНаименованию(ТекущееЗначение.Наименование);
					Если НЕ ЗначениеРеквизита = Неопределено Тогда
						ТекущийОбъект[Стр.РеквизитЗапчасти] = ЗначениеРеквизита;
						Изменен = Истина;
					КонецЕсли;
				ИначеЕсли Стр.РеквизитАвито = "Brand_ПроизводителиШин" Тогда
					ЗначениеРеквизита = Справочники.ns_ПроизводителиШин.НайтиЭлементПоНаименованию(ТекущееЗначение.Наименование);
					Если НЕ ЗначениеРеквизита = Неопределено Тогда
						ТекущийОбъект[Стр.РеквизитЗапчасти] = ЗначениеРеквизита;
						Изменен = Истина;
					КонецЕсли;
				Иначе	
					Попытка
						ЗначениеРеквизита = Перечисления["ns_" + Стр.РеквизитАвито].ПолучитьЗначениеПеречисления(ТекущееЗначение.Наименование);
					Исключение
						ЗначениеРеквизита = ТекущееЗначение;
					КонецПопытки;
					Если НЕ ЗначениеРеквизита = Неопределено Тогда
						ТекущийОбъект[Стр.РеквизитЗапчасти] = ЗначениеРеквизита;
						Изменен = Истина;
					КонецЕсли;
				КонецЕсли; 
			Исключение
			КонецПопытки; 
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) Экспорт
	
	// Данный функционал доступен с версии платформы 8.3.10
	Ключи = Строки.ПолучитьКлючи();
	
	СписокНоменклатуры = Новый Массив;
	Для каждого Ключ Из Ключи Цикл
		СписокНоменклатуры.Добавить(Ключ.Номенклатура);	
	КонецЦикла;
	
	НоменклатураСКартинками = ns_Переопределяемый.ПолучитьСписокНоменклатурыСКартинками(СписокНоменклатуры);
	Если НоменклатураСКартинками.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Строка Из Строки Цикл
		Если Строка.Ключ.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Если НоменклатураСКартинками[Строка.Ключ.Номенклатура] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Строка.Значение.Данные.ЕстьКартинка = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьРолиАвито() Экспорт
	
	Если ЕстьРольВПрофиле("ns_АвитоАдминистратор") Тогда
		ДобавитьРоль(Метаданные.Роли.ns_АвитоАдминистратор);
	КонецЕсли;
	Если ЕстьРольВПрофиле("ns_АвитоМенеджер") Тогда
		ДобавитьРоль(Метаданные.Роли.ns_АвитоМенеджер);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРоль(Роль)
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если Пользователь.Роли.Содержит(Роль) Тогда
	    Возврат;
	КонецЕсли;
	Пользователь.Роли.Добавить(Роль);
	Пользователь.Записать();
	ns_ОбщегоНазначения.СообщениеПользователю("Текущему пользователю добавлена роль для работы с Авито. Перезапустите 1С.");
КонецПроцедуры

Функция ЕстьРольВПрофиле(ИмяРоли, Пользователь = Неопределено) Экспорт
	
	Возврат Ложь;

	УстановитьПривилегированныйРежим(Истина);
	
	//Если Пользователь = Неопределено Тогда
	//	Попытка
	//		Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	//	Исключение
	//		Возврат Ложь;
	//	КонецПопытки;    
	//КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
		|		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
		|ГДЕ
		|	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
		|	И ГруппыДоступаПользователи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Роль", ИмяРоли);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;		
	Иначе	
		Возврат Истина;		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКлючФормы(СсылкаНаОбъект, ИмяСправочника) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ЗапчастиИАксессуары.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_ЗапчастиИАксессуары КАК ns_ЗапчастиИАксессуары
	|ГДЕ
	|	ns_ЗапчастиИАксессуары.Номенклатура = &Номенклатура";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ns_ЗапчастиИАксессуары", ИмяСправочника);
	Запрос.УстановитьПараметр("Номенклатура", СсылкаНаОбъект);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
КонецФункции
